app/views/friendships/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      <% @friendships.each do |user| %>
      <% x = User.find_by(id: user.friend_id)%>