app/views/posts/_index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 8]]
---
          <h5><%= post.content %><h5>
          <% liked = post.likes.find { |like| like.user_id == current_user.id} %>

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 8]]
---
          <% end %>
          <p><%= post.likes.count %> <%= (post.likes.count) == 1 ? 'Like' : 'Likes'%></p>