app/controllers/feed_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
  def index
    @user_friends = User.last(4)
    @user_posts = Post.order(created_at: :desc)