app/views/layouts/_header.html.erb

SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = $1  [["friend_id", 41]]
---
        <li class="nav-item">
          <%if current_user.pending_friendships.count > 0 %>